---
kind: enumMember
id: F:Autodesk.Revit.UI.ItemSelectionDialogResult.Confirmed
enum: Autodesk.Revit.UI.ItemSelectionDialogResult
source: html/2a3540c1-c4d8-50a8-793b-f662188abfca.htm
---
# Autodesk.Revit.UI.ItemSelectionDialogResult.Confirmed

The user selected one or more item(s) from the prompted dialog and
 confirmed the selection. The selected item(s) are available
 from the dialog interfaces.